In [1]:
import pandas as pd
import numpy as np
adams_act = pd.DataFrame(
                [
                  [12, 92],
                  [13, 65],
                  [14, 96]
                ],
                   columns=['Date', 'Act'])
print(adams_act)

   Date  Act
0    12   92
1    13   65
2    14   96

In [38]:
# 각 열에서 최소값이 위치한 인덱스
adams_act.idxmin()

Date    0
Act     1
dtype: int64

In [39]:
#각 행에서 최소값이 위치한 인덱스
adams_act.idxmin(axis=1)

0    Date
1    Date
2    Date
dtype: object

In [40]:
# 각 열에서 최대값이 위치한 인덱스
adams_act.idxmax()

Date    2
Act     2
dtype: int64

In [5]:
adams_act.std()

Date     1.000000
Act     16.862186
dtype: float64

In [6]:
adams_act.mean()

Date    13.000000
Act     84.333333
dtype: float64

In [7]:
adams_act.mad()

C:\Users\sunin\AppData\Local\Temp\ipykernel_33192\638011402.py:1: FutureWarning: The 'mad' method is deprecated and will be removed in a future version. To compute the same result, you may do `(df - df.mean()).abs().mean()`.
  adams_act.mad()

Date     0.666667
Act     12.888889
dtype: float64

In [8]:
(adams_act - adams_act.mean()).abs()

   Date        Act
0   1.0   7.666667
1   0.0  19.333333
2   1.0  11.666667

In [9]:
adams_act.cummin()

   Date  Act
0    12   92
1    12   65
2    12   65

In [10]:
adams_act.cummax()

   Date  Act
0    12   92
1    13   92
2    14   96

In [11]:
adams_act

   Date  Act
0    12   92
1    13   65
2    14   96

In [12]:
adams_act.cumsum()

   Date  Act
0    12   92
1    25  157
2    39  253

In [13]:
adams_act.cumprod()

   Date     Act
0    12      92
1   156    5980
2  2184  574080

In [14]:
adams_act.diff()

   Date   Act
0   NaN   NaN
1   1.0 -27.0
2   1.0  31.0

In [15]:
adams_act

   Date  Act
0    12   92
1    13   65
2    14   96

In [16]:
adams_act.pct_change()

       Date       Act
0       NaN       NaN
1  0.083333 -0.293478
2  0.076923  0.476923

In [17]:
(13-12)/12

0.08333333333333333

In [18]:
(14-13)/13

0.07692307692307693

In [19]:
(96-65)/65

0.47692307692307695

In [20]:
(65-92)/92

-0.29347826086956524

In [21]:
adams_act.expanding()

Expanding [min_periods=1,center=False,axis=0,method=single]

In [22]:
adams_act.expanding(1)

Expanding [min_periods=1,center=False,axis=0,method=single]

In [23]:
adams_act.expanding().sum()

   Date    Act
0  12.0   92.0
1  25.0  157.0
2  39.0  253.0

In [24]:
adams_act.expanding(min_periods=2).sum()

   Date    Act
0   NaN    NaN
1  25.0  157.0
2  39.0  253.0

In [25]:
adams_act.expanding(3).sum()

   Date    Act
0   NaN    NaN
1   NaN    NaN
2  39.0  253.0

In [26]:
adams_act.expanding().mean()

   Date        Act
0  12.0  92.000000
1  12.5  78.500000
2  13.0  84.333333

In [27]:
adams_act

   Date  Act
0    12   92
1    13   65
2    14   96

In [28]:
adams_act.rolling(window=3).sum()

   Date    Act
0   NaN    NaN
1   NaN    NaN
2  39.0  253.0

In [29]:
adams_act.rolling(window=2).sum()

   Date    Act
0   NaN    NaN
1  25.0  157.0
2  27.0  161.0

In [30]:
adams_act.rolling(window=2).mean()

   Date   Act
0   NaN   NaN
1  12.5  78.5
2  13.5  80.5

In [31]:
adams_act.kurt()

Date   NaN
Act    NaN
dtype: float64

In [32]:
data = np.random.randint(0, 100, 10)
kurt_df = pd.DataFrame(data)
kurt_df

    0
0  65
1  35
2  66
3  96
4  10
5  71
6  33
7  83
8  51
9  54

In [33]:
kurt_df.kurt()

0   -0.119207
dtype: float64

In [34]:
kurt_df.sem()

0    8.061155
dtype: float64

In [35]:
kurt_df.kurtosis()

0   -0.119207
dtype: float64

In [36]:
kurt_df.skew()

0   -0.311305
dtype: float64